Revit 2026 API

# CheckerCheckerColor1 Property

---

The property labeled "Color 1" from the "Checker" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CheckerColor1 { get; }
```
```vb
Public Shared ReadOnly Property CheckerColor1 As String
	Get
```
```cpp
public:
static property String^ CheckerColor1 {
	String^ get ();
}
```
```fsharp
static member CheckerColor1 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Checker Class

Autodesk.Revit.DB.Visual Namespace